
import re
from bnltk.stemmer import BanglaStemmer

bn_stemmer = BanglaStemmer()

STOPWORDS = ['অতএব','অথচ','অথবা','অনুযায়ী','অনেক','অনেকে','অনেকেই','অন্তত','অন্য','অবধি',
    'অবশ্য','অর্থাত','আগে','আগেই','আছে','আজ','আপনি','আমরা','আমাকে','আমাদের','আমার',
    'আমি','আর','আরও','ই','ইত্যাদি','উচিত','উপর','এ','এই','এক','একটি','এখন','এটা',
    'এবং','এমন','এর','ও','কখনও','কত','কবে','কয়েক','করছে','করতে','করবে','করা',
    'করে','করেছে','করেন','কিছু','কিন্তু','কে','কেউ','কেন','কোন','কোনও','খুব',
    'ছিল','ছিলেন','জন','জন্য','জানতে','জানা','ঠিক','তখন','তবে','তা','তাকে',
    'তাদের','তার','তারা','তিনি','তুমি','থাকবে','থেকে','দিতে','দিয়ে','দেন',
    'দুই','দুটি','দেওয়া','দেখতে','দেখা','দেখে','নয়','না','নিয়ে','নেই','পরে',
    'পর','প্রথম','প্রায়','ফলে','বলতে','বলে','বলেন','বেশি','মতো','মধ্যে',
    'মনে','যখন','যদি','যা','যাকে','যাতে','যাদের','যায়','যার','যারা','যিনি',
    'যে','রয়েছে','লক্ষ','শুধু','সব','সঙ্গে','সহ','সে','সেই','সেখানে',
    'হতে','হয়','হবে','হয়ে','হল','হলে']
def clean_article(text):
    text = re.sub(r'[^\u0980-\u09FF\s]', '', str(text))
    text = re.sub(r'\s+', ' ', text).strip()
    return text

def remove_stopwords(text):
    return " ".join(
        bn_stemmer.stem(w) for w in text.split() if w not in STOPWORDS
    )
